## 정렬, Aggreagation 함수, GroupBy 적용

DataFrame과 Series의 정렬을 위해서는 sort_values( ) 메서드를 이용한다. sort_values()는 RDBMS SQL의 order by키워드와 유사하다.
sort_values()의 주요 입력 파라미터는 by, ascending, inplace이다. by로 특정 칼럼을 입력하면 해당 칼럼으로 정렬을 수행한다.
ascending=True로 설정하면 오름차순으로 정렬하며, ascending=False로 설정하면 내림차순으로 설정된다. 기본(default)는 ascendling=True이다. inplace도 default는 inplace=False이다.

In [1]:
import numpy as np
import pandas as pd

In [4]:
titan_df = pd.read_csv('./train.csv')

## Series의 경우에는 Value 들이 값으로 호출되어
## sort_values를 그냥 사용 하여도 됨

titan_df['Name'].sort_values()

845                      Abbing, Mr. Anthony
746              Abbott, Mr. Rossmore Edward
279         Abbott, Mrs. Stanton (Rosa Hunt)
308                      Abelson, Mr. Samuel
874    Abelson, Mrs. Samuel (Hannah Wizosky)
                       ...
286                  de Mulder, Mr. Theodore
282                de Pelsmaeker, Mr. Alfons
361                del Carlo, Mr. Sebastiano
153          van Billiard, Mr. Austin Blyler
868              van Melkebeke, Mr. Philemon
Name: Name, Length: 891, dtype: object

In [8]:
### Dataframe을 정렬할 경우
titan_df.sort_values(by = 'Age') # 기준이 될 하나의 컬럼을 잡아서 정렬.
## 내림차순 정렬
# Ascending parameter를 조절
titan_df.sort_values(by = 'Age' , ascending=False)

## 1차 오름차순, 2차 오름차순??
titan_df.sort_values(by = ['Name','Age'] , ascending=[True, False])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.5500,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.2500,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
286,287,1,3,"de Mulder, Mr. Theodore",male,30.0,0,0,345774,9.5000,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5000,NaN,S
361,362,0,2,"del Carlo, Mr. Sebastiano",male,29.0,1,0,SC/PARIS 2167,27.7208,NaN,C
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S

### Aggregation 함수적용

Aggregation :: min(), max(), sum(), count() 와 같이 총합 또는 총계처리를 위한 함수

In [9]:
titan_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [10]:
### 특정 컬럼들의 평균 및 aggregation을 보고 싶다.
titan_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [13]:
titan_df.groupby(by ='Pclass').count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [15]:
titan_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
## 결측값이 존재하는
# 'Age'와 Cabin'의 컬럼만 호출 -1
titan_df.groupby(by='Pclass').count()[['Age', 'Cabin']]

        Age  Cabin
Pclass
1       186    176
2       173     16
3       355     12

In [17]:
# 'Age'와 Cabin'의 컬럼만 호출 -2
titan_df.groupby(by='Pclass')[['Age', 'Cabin']].count()

        Age  Cabin
Pclass
1       186    176
2       173     16
3       355     12

In [21]:
# 'Pclass' 에 따른 'Age', 'Fare' 의 최소, 최대값을
# groupby를 통해 구해보자.

titan_df.groupby(by='Pclass')[['Age', 'Fare']].agg(['max','min'])

         Age            Fare
         max   min       max  min
Pclass
1       80.0  0.92  512.3292  0.0
2       70.0  0.67   73.5000  0.0
3       74.0  0.42   69.5500  0.0

서로 다른 aggregation 함수를 groupby에서 호출하려면

SQL은 Select max(Age), sum(SibSp), avg(Fare) from titanic_table group by Pclass와 같이 쉽게 가능하다.

In [22]:
agg_format = {'Age':'max',
              'SibSp':'sum',
              'Fare':'mean'}

titan_df.groupby(by='Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

In [26]:
titan_df['Cabin'] = titan_df['Cabin'].fillna('N') # reassign(재할당)
titan_df['Age'] = titan_df['Age'].fillna(np.mean(titan_df['Age']))
titan_df['Embarked'] = titan_df.Embarked.fillna('N')

titan_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

### apply lambda 식으로 데이터 가공

In [ ]:
# break